Revit 2024 API
View.RemoveFilter Method
 Removes a filter from the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void RemoveFilter(
	ElementId filterElementId
)
Visual Basic
Public Sub RemoveFilter ( _
	filterElementId As ElementId _
)
Visual C++
public:
void RemoveFilter(
	ElementId^ filterElementId
)
Parameters
filterElementId
Type: Autodesk.Revit.DB.ElementId
 ElementId of the filter.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Filter is not applied to the view. -or- ElementId is not associated with a FilterElement.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
See Also
View Class
Autodesk.Revit.DB Namespace